In [1]:
print("Ok")

Ok

In [2]:
import pandas as pd

In [3]:
df = pd.read_csv("Visadataset.csv")
df.head(3)

,case_id,continent,education_of_employee,has_job_experience,requires_job_training,no_of_employees,yr_of_estab,region_of_employment,prevailing_wage,unit_of_wage,full_time_position,case_status
0,EZYV01,Asia,High School,N,N,14513,2007,West,592.2029,Hour,Y,Denied
1,EZYV02,Asia,Master's,Y,N,2412,2002,Northeast,83425.6500,Year,Y,Certified
2,EZYV03,Asia,Bachelor's,N,Y,44444,2008,West,122996.8600,Year,Y,Denied

In [4]:
df.shape

(25480, 12)

In [5]:
# Converting the df to dictionary for the purpose of storing on mongodb
data = df.to_dict(orient='records')

In [6]:
len(data)

25480

In [17]:
import os
from dotenv import load_dotenv
load_dotenv()

True

In [ ]:
# CONNECTION_URL2 = os.getenv('MONGODB_URL_KEY')
# CONNECTION_URL3=os.environ["MONGODB_URL_KEY"]

In [22]:
# Now define the required variable for Mongodb
DB_NAME = 'mlops_db'
COLLECTION_NAME = 'travel'
CONNECTION_URL =  os.getenv('MONGODB_URL_KEY')

In [7]:
import pymongo

In [9]:
client = pymongo.MongoClient(CONNECTION_URL)
db = client[DB_NAME]
collection = db[COLLECTION_NAME]

#Now to ingest the data into Mongodb
records = collection.insert_many(data)

In [10]:
# To load the ingested data back to the notebook
reload_records = collection.find()

In [11]:
# Better still, the reloaded records can be inform of a df 
reload_df = pd.DataFrame(list(collection.find()))
reload_df.head(3)

,_id,case_id,continent,education_of_employee,has_job_experience,requires_job_training,no_of_employees,yr_of_estab,region_of_employment,prevailing_wage,unit_of_wage,full_time_position,case_status
0,692aaaba12fa569d58c11fc1,EZYV01,Asia,High School,N,N,14513,2007,West,592.2029,Hour,Y,Denied
1,692aaaba12fa569d58c11fc2,EZYV02,Asia,Master's,Y,N,2412,2002,Northeast,83425.6500,Year,Y,Certified
2,692aaaba12fa569d58c11fc3,EZYV03,Asia,Bachelor's,N,Y,44444,2008,West,122996.8600,Year,Y,Denied

In [12]:
# _id is always added to the recodrd when ingesting into mongo db
# To remove this _id, simply do:
if "_id" in reload_df.columns.to_list():
    reload_df = reload_df.drop("_id", axis=1)

In [13]:
reload_df.head(3)

,case_id,continent,education_of_employee,has_job_experience,requires_job_training,no_of_employees,yr_of_estab,region_of_employment,prevailing_wage,unit_of_wage,full_time_position,case_status
0,EZYV01,Asia,High School,N,N,14513,2007,West,592.2029,Hour,Y,Denied
1,EZYV02,Asia,Master's,Y,N,2412,2002,Northeast,83425.6500,Year,Y,Certified
2,EZYV03,Asia,Bachelor's,N,Y,44444,2008,West,122996.8600,Year,Y,Denied